tap "oven-sh/bun"
brew "btop"
brew "ca-certificates"
brew "cloc"
brew "openssl@3"
brew "curl"
brew "exiftool"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "hugo"
brew "ipinfo-cli"
brew "jq"
brew "lazygit"
brew "mise"
brew "neovim"
brew "python@3.14"
brew "nmap"
brew "pwgen"
brew "restish"
brew "ripgrep"
brew "ruff"
brew "sqlc"
brew "starship"
brew "tree"
brew "uv"
brew "yt-dlp"
brew "oven-sh/bun/bun"
cask "brave-browser"
cask "docker-desktop"
cask "draw-things"
cask "font-fira-code-nerd-font"
cask "ghostty"
cask "goland"
cask "keepassxc"
cask "netnewswire"
cask "pearcleaner"
cask "pycharm"
cask "signal"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
cask "wireshark-app"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hverlin.mise-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "redhat.vscode-yaml"
vscode "repreng.csv"
vscode "tamasfe.even-better-toml"
vscode "yzhang.markdown-all-in-one"
go "golang.org/x/tools/gopls"
